aerolink/tests/performance/jmeter/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
1. Login,1000,221,186,334,386,489,154,1339,0.000%,3.90114,1.13,1.11
2. Get User Profile,1000,199,169,296,315,454,154,553,0.000%,3.90444,0.75,1.27
3. Get All Flights,1000,178,159,308,312,333,153,620,0.000%,3.90433,0.86,0.69
4. Create Booking,1000,220,175,350,426,544,158,722,0.000%,3.90761,0.92,1.76
5. Update Baggage,1000,173,157,242,310,335,150,367,0.000%,3.90781,0.70,1.36
6. Get Baggage Status,1000,158,157,169,181,190,150,228,0.000%,3.91108,0.85,0.73
7. Cancel Booking,1000,261,171,544,660,847,153,1777,50.000%,3.91099,0.82,1.75
8. Admin Login,1000,202,177,296,318,465,154,540,0.000%,3.91100,1.11,1.09
9. Admin View All Bookings,1000,277,183,586,703,914,153,1103,50.000%,3.90352,44.96,1.28
TOTAL,9000,210,164,322,431,694,150,1777,11.111%,34.86534,51.69,10.93